scripts/soap-env.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:ws="http://ws.inventory/">
<soapenv:Header/>
<soapenv:Body>
<ws:itemById>
  <id>13403</id>
</ws:itemById>
</soapenv:Body>
</soapenv:Envelope>
